{
	"w": {
		"microsoft": "Microsoft",
		"name": "Name",
		"age": "Age",
		"yearsOld": " years old",
		"birthday": "Birthday",
		"yokohama": "Yokohama City",
		"webDev": "Web Development",
		"minecraft": "Minecraft",
		"hardware": "Hardware",
		"model": "Model",
		"memory": "Memory",
		"gpu": "GPU",
		"software": "Software",
		"shell": "Shell",
		"desktopEnv": "Desktop Environment",
		"webBrowser": "Web Browser",
		"codeEditor": "Code Editor",
		"tags": "Tags",
		"rssAtomFeed": "RSS / Atom feed",
		"share": "Share",
		"domain": "Domain",
		"webShareApi": "Web Share API",
		"jaLang": "Japanese lang.",
		"sitemap": "Site Map",
		"otherLinks": "Other links",
		"bgWallpaper": "Background wallpaper",
		"home": "Home",
		"profile": "Profile",
		"blog": "Blog",
		"webTools": "Web Tools",
		"projects": "Projects",
		"creations": "Creations",
		"social": "Social",
		"privacyPolicy": "Privacy Policy",
		"acknowledgments": "Acknowledgments",
		"illustration": "Illustration",
		"category": "Category",
		"usedTools": "Used tools",
		"license": "License",
		"all": "All",
		"establishedOn": "Established on {date}",
		"revisedOn": "Revised on {date}",
		"repo": "Repository",
		"website": "Website"
	},
	"home": {
		"icon": "Rinrin.rs' avatar",
		"greeting": ["Hi there!!!", "I'm a {age}year-old Japanese student."],
		"contents": "of this home",
		"whatIDo": "what i usually do",
		"chronicle": "my history",
		"recentArticles": "Recent articles:",
		"viewAll": "View all",
		"contact": "Basically, I can respond by joining my Discord server and contacting me there, or by direct messaging me on Discord.\nI might not notice them when I am out, so if it's urgent, please send me an email instead.",
		"otherSocial": "Other social accounts"
	},
	"header": {
		"language": "日本語",
		"skip": "Skip to main content"
	},
	"footer": {
		"bgWallpaper": "Wallpaper"
	},
	"error": { "pageNotFound": ["404 not like this!", "this page does not exist :("] },
	"activities": {
		"programming": {
			"desc": "I began programming when I was about 13, but my knowledge is limited to a few areas.",
			"rust": "This is my favorite language 🦀. My online handle \"Rinrin.rs\" also includes the \".rs\" extension.",
			"graphics": {
				"desc": "After developing shader packs for Minecraft Bedrock Edition, I became interested in this field.",
				"langsToUse": "The languages I use:",
				"mayNotUse": "no longer use maybe"
			},
			"webdev": [
				"Writing stylesheets is very stressful so I basically don't wanna work on this. I usually use SCSS from ",
				" (since SASS's indentation rules don't suit me). In other words, I don't have much motivation for web development. So I have never used a framework other than ",
				". This website was built with it.",
				"and I HATE MOBILE SAFARI."
			],
			"git": [
				"I have learned the basics of Git, but I often forget the command-line options. I am quite sloppy about managing branches in my personal repositories. I mainly use ",
				" for remote repository hosting."
			]
		},
		"game": {
			"desc": "Single-player RPGs are not listed here.",
			"tetrio": "TETR.IO is a modern yet familiar online stacker in the same genre as certain Russian puzzle games. I am not very good at this game but it is fun to play once in a while.",
			"mc": [
				"Minecraft is one of the games I have played for the longest time. I no longer play the Wii U Edition or Bedrock Edition; I currently play the Java Edition. In the Wii U Edition, I used to build many structures. After moving to the Bedrock Edition, I started developing add-ons and shader packs. However, I got sick of it because of ",
				"'s repeated nonsense. Currently, I am developing shader packs for the Java Edition at my own pace."
			],
			"sky": "I was born in the Season of Assembly, but I am not logging in much lately. I might log in if you invite me."
		},
		"music": {
			"listen": "I like piano music from the Classical and Romantic musical eras, and I am especially drawn to Franz Liszt's pieces. In recent years, I have started listening to not only piano music but also orchestral pieces and lieder (classical art songs).",
			"play": "I play classical music on the piano but I am not very good at it. I quickly get tired of piano practice so I am often satisfied with just playing some of my favorite melodies.",
			"compose": [
				"I compose classical-style music and arrange/transcribe classical music. Occasionally, I compose pieces like popular music. However, I am still learning musical theories. I mainly use ",
				" for composing, arranging, and transcribing."
			],
			"sing": "I don't usually sing much because I am not very familiar with songs with lyrics. The songs I can sing are Pretty Cure songs, GHIBLI songs that I bought on CD and listened to in the past, and other songs that I had to sing during compulsory education, etc."
		}
	},
	"chronicle": {
		"expand": "Click to expand",
		"2006": {
			"4": "was born in Yokohama City"
		},
		"2011": {
			"null": "Around this time, I had been playing Ameba Pigg on Windows 7 and have called myself \"rinrin\" since then."
		},
		"2013": {
			"4": "Enrolled in a special needs class at an elementary school."
		},
		"2015": {
			"6": "Moved to Tochigi Prefecture."
		},
		"2016": {
			"12": "Played Minecraft for the first time. (Wii U Edition)"
		},
		"2019": {
			"3": "Moved to Chiba Prefecture after graduating from elementary school.",
			"4": "Started playing Minecraft Bedrock Edition. (Windows 10 Edition)"
		},
		"2020": {
			"5": "Started learning Python to create Discord bots.",
			"null": "In mid-2020, my congenital disorder began to worsen."
		},
		"2021": {
			"4": "After spring break, became unable to talk and was no longer able to attend school.",
			"5": "Started developing shader packs for Minecraft for Windows.",
			"11": "Started learning the Rust programming language."
		},
		"2022": {
			"3": "Bought a new desktop computer and reinstalled Windows for a certain reason.",
			"4": "Enrolled at S High School.",
			"6": "After all, I hate Windows, so I installed openSUSE Leap as my main OS. Somehow the installation was successful this time."
		},
		"2023": {
			"2": "Rewrote this website using SvelteKit."
		},
		"2025": {
			"4": "Enrolled at ZEN University as a first-generation student."
		},
		"2036": {
			"4": "I have thought right after I was born that how old will I be in 30 years later."
		}
	},
	"profile": {
		"intro": [
			"Hi there, I'm Rinrin.rs.",
			"am a student, Japanese, {age} years old. and have ASD.",
			"I'm mainly on Discord.",
			"I'll write code.",
			"Basically i would not work Web dev.",
			"may be able to draw a simple pixel art.",
			"also compose music as a hobby."
		],
		"birthday": "April 13th, 2006",
		"primaryLang": "Primary lang.",
		"timezone": "Timezone",
		"birthplace": "Birthplace",
		"hobby": "see"
	},
	"skills": {
		"summary": "Click to expand",
		"rust": "I love it because it's fun to write.",
		"git": "I make mistakes occasionally, but so I have gotten used to resolving them.",
		"glslWgslHlsl": [
			"I am not good at coding that requires advanced mathematics.",
			"Originally I was developing shaderpacks for Minecraft."
		],
		"webDev": {
			"0": "I dislike this field because stylesheets are very stressful.",
			"svelte": [
				"I usually use SvelteKit when build websites. This website was made with it too.",
				"I have never used any other frameworks."
			],
			"htmlCssJs": "I HATE CSS.",
			"sass": [
				"I like the mixins and variables etc. of Sass.",
				"I use SCSS because I dislike the indentation syntax."
			]
		},
		"python": [
			"This is actually the first language I learned.",
			"There is anaphylaxis risks, but it is not like I can't write it anymore."
		],
		"minecraft": [
			"I used to build Japanese-style architecture. And I am not good at Western-style buildings.",
			"At one point, I was also developing add-ons for Bedrock Edition, but I am not gonna do it anymore.",
			"Currently, I occasionally develop shaderpacks for Java Edition when feeling motivated."
		],
		"linux": [
			"My main desktop OS is openSUSE Leap 15.6.",
			"I am not using Linux for server purposes so it is hard to say it is a skill."
		],
		"illustration": [
			"I am able to draw simple pixel art.",
			"I used to draw analog art but I rarely draw now."
		]
	},
	"env": {
		"intro": "My various soil and environments",
		"notes": ["see ", "(Japanese) for more details and devices"]
	},
	"social": {
		"desc": "List of my social accounts"
	},
	"blog": {
		"backToIndex": "Back to index",
		"noMatchingArticlesFound": "No matching articles found."
	},
	"acknowledgments.desc": "Thank you for all OSS and services that used in the development of this website.",
	"tools": {
		"backToIndex": "Back to tool list",
		"noMatchingToolsFound": "No matching tools found.",
		"notes": [
			"The accuracy of the results provided by the tools on this website is not guaranteed.",
			"If you come across any issues or problems, I would appreciate it if you could report them on ",
			"."
		]
	},
	"projects": {
		"status": "Dev. status",
		"statuses": {
			"wip": "Work in progress",
			"active": "Active",
			"completed": "Completed",
			"archived": "Archived",
			"abandoned": "Abandoned"
		},
		"noMatchingProjectsFound": "No matching projects found.",
		"latestUpdate": "Latest update",
		"initRelease": "Initial release",
		"writtenIn": "Written in",
		"backToIndex": "Back to project list"
	},
	"creations": {
		"dateUnknown": "Date unknown",
		"backToIndex": "Back to artwork list",
		"noMatchingArtworksFound": "No matching artworks found.",
		"textureAtlasPlayer": {
			"title": "Texture Atlas Player",
			"frames": "frames"
		},
		"musicPiece": {
			"identifier": "Identifier",
			"none": "None",
			"nameEn": "English Name",
			"nameJa": "Japanese Name",
			"period": "Composition Period",
			"formation": "Formation",
			"originalPiece": "Original Piece"
		},
		"musicScore": {
			"dlScore": "Download the score",
			"scorePreview": "The score preview"
		}
	},
	"privacy": {
		"desc": "This Privacy Policy outlines the use of access analytics on this website:",
		"analytics": [
			"On this website, we use ",
			" provided by Cloudflare, Inc. to analyze the behavior of visitors to this website. Cloudflare Web Analytics does not use any client-side state, such as cookies or localStorage, to collect usage metrics. We also don’t “fingerprint” individuals via your IP address, User Agent string, or any other data for the purpose of displaying analytics. These analytics are non-invasive and respect your privacy.",
			"However, some pages on this website contain embedded content from",
			" (",
			") and",
			" (",
			"). As a result, each service may collect access information. For more details, please refer to Noteflight's \"",
			"\" page and SoundCloud's \"",
			"\" page."
		]
	},
	"copy": {
		"copy": "Copy",
		"copied": "Copied:",
		"failed": "Failed to copy."
	},
	"tag": {
		"clearFilters": "Clear filters"
	},
	"shareBtn": {
		"copyUrl": "Copy URL",
		"post": "Post",
		"toot": "Toot",
		"note": "Note"
	}
}
